//1. დაწერეთ პროგრამა, რომ იპოვოთ მასივის ყველა რიცხვის ჯამი.
// let array = [1, 2, 3, 4, 5]
// function sum(arr){
//     let count = 0;
//     for(let i = 0;i < arr.length; i++){
//         count = count + arr[i]
//     }
//     return count
// }
// console.log(sum(array))
//2. დაწერეთ პროგრამა მასივში რიცხვების საშუალოს საპოვნელად.
// let array = [1, 2, 3, 4, 5]
// function average(arr){
//     let count = 0
//     for(let i = 0; i < arr.length; i++){
//         count = count + arr[i]
//     }
//     return count / arr.length
// }
// console.log(average(array))
//3. დაწერეთ პროგრამა რიცხვების მასივის ზრდის მიხედვით დასალაგებლად.

//4. დაწერეთ პროგრამა მასივში ყველაზე დიდი ელემენტის მოსაძებნად.
// function bigElement(...args){
//     let maxElement = args[0][0]; 
//     for (let i = 0; i < args.length; i++) {
//         for (let j = 0; j < args[i].length; j++) {
//             if (args[i][j] > maxElement) {
//                 maxElement = args[i][j];
//             }
//         }
//     }

//     return maxElement;
// }
// console.log(bigElement([1,2], [3,4,5,6],[7,8]))
//5. დაწერეთ პროგრამა მასივის ყველაზე პატარა ელემენტის მოსაძებნად.

//6. დაწერეთ პროგრამა, რათა შეამოწმოთ, შეიცავს თუ არა მასივი კონკრეტულ ელემენტს.
// function includesWords(...args){
//     let arr = args[0];
//     for(let i = 0; i < arr.length;i++ ){
//         if(arr[i] === 'sergi'){
//             return true; 
//         }
//     }
//     return false;
// }
// console.log(includesWords(['sergi', 'gio', 'nika', 'sandro']));
//7. დაწერეთ პროგრამა მასივიდან ელემენტის ამოსაღებად.
//8. დაწერეთ პროგრამა მასივში კონკრეტული ელემენტის გავრცელების რაოდენობის დასათვლელად.
//9. დაწერეთ პროგრამა, რომ იპოვოთ მასივის ყველა ლუწი რიცხვის ჯამი.
//10. დაწერეთ პროგრამა მასივში სიდიდით მეორე რიცხვის მოსაძებნად.
//11. დაწერეთ პროგრამა, რათა შეამოწმოთ არის თუ არა ორი მასივი ტოლი.
//12. დაწერეთ პროგრამა რომ ორი სორტირებული მასივის შერთდეს და გახდეს ერთი მასივი რომელიც ასევე სორტირებული იქნება.
//13. დაწერეთ პროგრამა სტრიქონების მასივის ანბანის მიხედვით დასალაგებლად.
//14. დაწერეთ პროგრამა მრავალ მასივებს შორის საერთო ელემენტების მოსაძებნად.

//15. შექმენით ობიექტი სახელწოდებით car თვისებებით მარკის, მოდელისა და წლისთვის. დაბეჭდეთ ობიექტი კონსოლზე.
//16. დაამატეთ მეთოდი car ობიექტს სახელწოდებით start, რომელიც ბეჭდავს "The car is starting!" როდესაც გამოძახება. გამოიძახეთ დაწყების მეთოდი.
//17. შექმენით სხვა ობიექტი სახელად Person სახელის, ასაკისა და ქალაქის თვისებებით. დაბეჭდეთ სახელის თვისება წერტილის გამოყენებით.
//18. დაამატეთ ახალი თვისება სახელწოდებით job, person ობიექტს და მიანიჭეთ მას მნიშვნელობა. დაბეჭდეთ განახლებული ობიექტი.